Revit 2026 API

# IFCParameterTemplateGetActiveTemplate Method

---

Gets the active mapping template element in the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IFCParameterTemplate GetActiveTemplate(
	Document document
)
```
```vb
Public Shared Function GetActiveTemplate (
	document As Document
) As IFCParameterTemplate
```
```cpp
public:
static IFCParameterTemplate^ GetActiveTemplate(
	Document^ document
)
```
```fsharp
static member GetActiveTemplate :
        document : Document -> IFCParameterTemplate
```

#### Parameters

document Document
     The document to find the active mapping template.

#### Return Value

IFCParameterTemplate The active mapping template, or  if none.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

New documents have no active mapping template and it implies in-session template usage.

#### Reference

IFCParameterTemplate Class

Autodesk.Revit.DB Namespace